import { TermsSection } from "../types/terms-and-conditions.types";

export const termsAndConditionsData: TermsSection[] = [
  {
    id: 1,
    title: "1. ზოგადი დებულებები",
    items: [
      "წინამდებარე წესები და პირობები წარმოადგენს იურიდიულ შეთანხმებას მომხმარებელსა და პლატფორმას შორის",
      "ვებსაიტზე რეგისტრაციით ან Google-ის მეშვეობით ავტორიზაციით, თქვენ ადასტურებთ, რომ გაეცანით და ეთანხმებით ამ პირობებს.",
      "სერვისით სარგებლობა დასაშვებია მხოლოდ იმ პირებისთვის, რომელთაც შეუსრულდათ 18 წელი ან გააჩნიათ კანონიერი უფლებამოსილება.",
    ],
  },
  {
    id: 2,
    title: "2. ავტორიზაცია და უსაფრთხოება",
    items: [
      "ავტორიზაცია ხორციელდება Google-ის ანგარიშის გამოყენებით. მომხმარებელი პასუხისმგებელია საკუთარი ანგარიშის უსაფრთხოებაზე.",
      "ჩვენ არ გვაქვს წვდომა თქვენს Google-ის პაროლზე. პროცესი იმართება Google-ის უსაფრთხოების სტანდარტების შესაბამისად..",
    ],
  },
  {
    id: 3,
    title: " 3. მომხმარებლის ვალდებულებები",
    items: [
      "მომხმარებელი იღებს სრულ პასუხისმგებლობას მის მიერ დაწერილი წერილის შინაარსზე.",
      "აკრძალულია სერვისის გამოყენება უკანონო, შეურაცხმყოფელი, მუქარის შემცველი ან სხვისი პირადი ცხოვრების ხელმყოფი ინფორმაციის გასავრცელებლად.",
      "აკრძალულია პლატფორმის მუშაობისთვის ხელის შეშლა ან ნებისმიერი სახის კიბერშეტევის მცდელობა.",
    ],
  },
  {
    id: 4,
    title: "4. სერვისის მიწოდება და პასუხისმგებლობის შეზღუდვა",
    items: [
      "ჩვენ ვუზრუნველყოფთ წერილის შენახვას და მის გაგზავნას მითითებულ დროს, თუმცა არ ვაგებთ პასუხს მესამე მხარის (ინტერნეტ პროვაიდერი, ელ-ფოსტის სერვისი) ხარვეზებზე.",
      "ჩვენ არ ვართ პასუხისმგებელი წერილის შინაარსის დაკარგვაზე, თუ ეს გამოწვეულია მომხმარებლის მიერ Google-ის წვდომის გაუქმებით ან ანგარიშის წაშლით.",
    ],
  },
  {
    id: 5,
    title: " 5. ინტელექტუალური საკუთრება",
    items: [
      "ვებსაიტის დიზაინი, ლოგო, ტექსტები და პროგრამული კოდი წარმოადგენს ჩვენს საკუთრებას.",
      "მომხმარებლის მიერ შექმნილი კონტენტი (წერილის ტექსტი) რჩება მომხმარებლის საკუთრებაში და ჩვენ მას ვიყენებთ მხოლოდ სერვისის ტექნიკური შესრულებისთვის.",
    ],
  },
  {
    id: 6,
    title: " 6. ცვლილებები და გაუქმება",
    items: [
      "ჩვენ ვიტოვებთ უფლებას, ნებისმიერ დროს შევცვალოთ ეს პირობები. განახლებული პირობები ძალაში შედის გამოქვეყნებისთანავე.",
      "წესების დარღვევის შემთხვევაში, ჩვენ უფლებას ვიტოვებთ, დაუყოვნებლივ შევზღუდოთ მომხმარებლის წვდომა პლატფორმაზე.",
    ],
  },
];
