import {
  privacyPolicyContentProps,
  PrivacyPolicySection,
} from "../types/privacy-policy.types";

export const privacyPolicyData: PrivacyPolicySection[] = [
  {
    id: 1,
    title: " 1. მონაცემთა შეგროვება",
    description:
      "ჩვენ ვაგროვებთ მხოლოდ იმ მინიმალურ ინფორმაციას, რომელიც აუცილებელია სერვისის სრულფასოვანი მუშაობისთვის.",

    descriptionClassName: "mb-3.5",
    items: [
      {
        type: "text",
        value:
          "ავტორიზაციის დროს Google-ის მეშვეობით ვიღებთ თქვენი ანგარიშის ძირითად მონაცემებს: ელფოსტის მისამართს, პროფილის ფოტოს, სახელსა და გვარს.",
      },
      {
        type: "text",
        value:
          "მონაცემების სხვა დანიშნულებით გამოყენება შესაძლებელია მხოლოდ თქვენი თანხმობით.",
      },
    ],
  },
  {
    id: 2,
    title: " 2. მონაცემთა გამოყენების მიზანი",
    description:
      "თქვენი მონაცემები გამოიყენება მხოლოდ ანგარიშის იდენტიფიკაციისა და მომსახურების მიწოდების მიზნით.",
    descriptionClassName: "mb-3.5",
    items: [
      {
        type: "text",
        value:
          "ჩვენ მიერ დამუშავებული ინფორმაცია არ გამოიყენება მესამე პირებისთვის კომერციული მიზნებით.",
      },
    ],
  },
  {
    id: 3,
    title: " 3. მესამე მხარეები",
    items: [
      {
        type: "text",
        value:
          "Google Services: ავტორიზაციის პროცესში გამოიყენება Google-ის სერვისი, რის გამოც ინფორმაცია მუშავდება Google-ის კონფიდენციალურობის პოლიტიკის შესაბამისად.",
      },
      {
        type: "text",
        value:
          "ჩვენ არ ვუზიარებთ თქვენს პერსონალურ ინფორმაციას მესამე მხარეებს, გარდა კანონით გათვალისწინებული შემთხვევებისა.",
      },
    ],
  },
  {
    id: 4,
    title: "4. მონაცემთა შენახვა",
    items: [
      {
        type: "text",
        value:
          "თქვენი მონაცემები ინახება მხოლოდ იმდენი ხნის განმავლობაში, რამდენიც საჭიროა მომსახურების გასაწევად.",
      },
      {
        type: "text",
        value:
          "ინფორმაცია დაცულია შესაბამისი ტექნიკური და ორგანიზაციული უსაფრთხოების ზომებით.",
      },
    ],
  },
  {
    id: 5,
    title: " 5. თქვენი უფლებები",
    description: "თქვენ ნებისმიერ დროს შეგიძლიათ:",
    items: [
      {
        type: "text",
        value: "მოითხოვოთ თქვენი მონაცემების წაშლა.",
      },
    ],
  },
  {
    id: 6,
    title: "6. საკონტაქტო ინფორმაცია",
    description:
      "ამ პოლიტიკასთან დაკავშირებული კითხვების შემთხვევაში, გთხოვთ დაგვიკავშირდეთ:",
    items: [
      {
        type: "email",
        title: "ელ-ფოსტა :",
        value: " https://infounilab@iliauni.edu.ge",
      },
    ],
  },
];

export const privacyPolicyTitle = {
  title:
    "იღებს, დაიცვას თქვენი პერსონალური მონაცემები. წინამდებარე კონფიდენციალურობის პოლიტიკა  პოლიტიკა განგიმარტავთ, თუ როგორ ვაგროვებთ, ვიყენებთ და ვიცავთ თქვენს ინფორმაციას.",
};

export const privacyPolicyContent: privacyPolicyContentProps = {
  title: "კონფიდენციალურობის პოლიტიკა",
  description:
    "ჩვენი გუნდი პატივს სცემს თქვენს კონფიდენციალურობას და ვალდებულებას იღებს, დაიცვას თქვენი პერსონალური მონაცემები. წინამდებარე კონფიდენციალურობის პოლიტიკა განგიმარტავთ, თუ როგორ ვაგროვებთ, ვიყენებთ და ვიცავთ თქვენს ინფორმაციას.",
};
